### pandas   
* python으로 하는 excel
* datatype
1. Series <- numpy 1차원 vector
2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

In [64]:
import numpy as np
import pandas as pd

#### Series
* series = numpy array vector + index
* numpy array vector : 인덱스가 없다.
* pd.Series()

In [65]:
L = [2,4,6,8]
s = pd.Series(L)
s

0    2
1    4
2    6
3    8
dtype: int64

In [66]:
L = [2,4,6,8]
s = pd.Series(L, index = ['a', 'b', 'c', 'd'])
s

a    2
b    4
c    6
d    8
dtype: int64

In [67]:
s['c']

6

In [68]:
s['c'] = 10
s

a     2
b     4
c    10
d     8
dtype: int64

In [69]:
s[['c', 'd']]   # 여러 요소를 넣을 때는 대괄호 2개

c    10
d     8
dtype: int64

In [70]:
s > 5   # Broadcasting > element wise operating

a    False
b    False
c     True
d     True
dtype: bool

In [71]:
s[s>5]

c    10
d     8
dtype: int64

In [72]:
s * 2

a     4
b     8
c    20
d    16
dtype: int64

In [73]:
'a' in s

True

In [74]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [75]:
s.values

array([ 2,  4, 10,  8], dtype=int64)

In [76]:
s.index = ['가' ,'나', '다', '라']
s

가     2
나     4
다    10
라     8
dtype: int64

#### DataFrame
* series 가 column 단위로 붙어서 만들어진 matrix (series => dataframe)
* pd.DataFrame()

In [77]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'amy'],
            'last_name' : ['miller', np.nan, 'ali', 'milner', 'coozer'],
            'age' : [42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'postestscore' : [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [78]:
# key : columns  /  value : columns 값
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

데이터를 가공할 때 일반적인 처리 방식

column - 특징을 칼럼으로 잡는다.    ex) 학생의 학년, 이름, 주소, 성적 등...   
row - 개별 데이터.      ex) 첫번째학생, 두번째학생...   

column : feature, 열   
row : data, 행

* 하나의 칼럼 : 하나의 series   < np.array  < 원소가 동일한 데이터타입으로 구성
* dataframe => 여러 series가 연결된 matrix

- 하나의 칼럼에는 동일한 타입의 데이터로 구성된다
- 칼럼 간에는 다른 데이터타입의 칼럼들이 존재한다

In [79]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [80]:
df.iloc[0]

first_name       jason
last_name       miller
age               42.0
pretestscore       4.0
postestscore      25.0
Name: 0, dtype: object

In [38]:
# 속성으로 칼럼을 접근하는 방식 (가능하면 안쓰는게 좋긴함)
# 칼럼 이름에 공백이 있으면 안됨
df.first_name
# 칼럼을 수정할 때 주의가 필요
df['age'].apply(lambda x : x*10)

0    420.0
1      NaN
2    360.0
3    240.0
4    730.0
Name: age, dtype: float64

In [33]:
df[['last_name', 'age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [81]:
df.head(2)

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [82]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [83]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'postestscore'], dtype='object')

In [84]:
df.values   # array 형식으로 출력됨

array([['jason', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan, nan],
       ['jake', 'milner', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

> row indexing :   

df.loc[index name]   
df.iloc[index order num]

loc[], iloc[] - row와 column을 동시에 선택할 수도 있다.

In [48]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [49]:
df.loc['d']

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [50]:
df.iloc[3]

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [52]:
df.iloc[3:] == df.loc['d':]

   first_name  last_name   age  pretestscore  postestscore
d        True       True  True          True          True
e        True       True  True          True          True

In [53]:
df.loc[['c','e']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [55]:
df.loc['b' : 'd']   # 'd'도 출력됨!!!!

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0

In [56]:
df.loc['c', 'last_name']

'ali'

In [57]:
df.loc[['c','d'], 'first_name' : 'age']

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [58]:
df.iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [59]:
df.iloc[3,3] = 100
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [61]:
df.iloc[::2,::2]

  first_name   age  postestscore
a      jason  42.0          25.0
c       tina  36.0           NaN
e        amy  73.0          72.0

> dataframe에 boolean indexing도 가능하다   => row indexing : loc[]

In [63]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [65]:
df[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [66]:
df[df['last_name'] == 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN

In [71]:
df[df['age'] >= 40]['postestscore'].mean()

48.5

> 새로운 칼럼 추가

In [72]:
df['address'] = ['seoul', 'incheon', 'busan', 'daejeon', 'gwangju']
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN    busan
d       jake    milner  24.0         100.0          62.0  daejeon
e        amy    coozer  73.0           4.0          72.0  gwangju

> 칼럼명 수정

In [73]:
df.columns = ['fn', 'ln', 'age', 'pre','post','add']
df

      fn      ln   age    pre  post      add
a  jason  miller  42.0    4.0  25.0    seoul
b    NaN     NaN   NaN    NaN   NaN  incheon
c   tina     ali  36.0    NaN   NaN    busan
d   jake  milner  24.0  100.0  62.0  daejeon
e    amy  coozer  73.0    4.0  72.0  gwangju

In [76]:
# df = df.rename(columns = {'add' : 'address'})
df.rename(columns = {'add' : 'address'}, inplace=True)  # inplace를 쓰면 반환만 하는게 아니라 반내용이 반환값으로 바뀜
df

      fn      ln   age    pre  post  address
a  jason  miller  42.0    4.0  25.0    seoul
b    NaN     NaN   NaN    NaN   NaN  incheon
c   tina     ali  36.0    NaN   NaN    busan
d   jake  milner  24.0  100.0  62.0  daejeon
e    amy  coozer  73.0    4.0  72.0  gwangju

> column, row 삭제

In [ ]:
df.drop('address', axis = 1, inplace=True)

In [81]:
df

      fn      ln   age    pre  post
a  jason  miller  42.0    4.0  25.0
b    NaN     NaN   NaN    NaN   NaN
c   tina     ali  36.0    NaN   NaN
d   jake  milner  24.0  100.0  62.0
e    amy  coozer  73.0    4.0  72.0

In [82]:
df.drop('c', inplace=True) # axis의 default값은 0

In [83]:
df

      fn      ln   age    pre  post
a  jason  miller  42.0    4.0  25.0
b    NaN     NaN   NaN    NaN   NaN
d   jake  milner  24.0  100.0  62.0
e    amy  coozer  73.0    4.0  72.0

In [85]:
df.drop(['ln', 'pre'], axis=1)

      fn   age  post
a  jason  42.0  25.0
b    NaN   NaN   NaN
d   jake  24.0  62.0
e    amy  73.0  72.0

In [3]:
ecom = pd.read_csv('Ecommerce Purchases.csv')
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [46]:
ecom.head(100)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,"4445 Christopher Well Apt. 053\nRonaldton, KS ...",33 Uu,PM,Opera/9.21.(Windows NT 6.1; sl-SI) Presto/2.9....,Moore-Hall,3088798824982514,04/18,928,JCB 16 digit,arellanopatrick@thomas.net,Dealer,59.216.3.55,fr,19.56
96,"17923 Carol Lake Suite 232\nNew Andre, MD 0577...",20 bk,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_8...,Knight LLC,60498172646,09/25,600,Voyager,mannlisa@yahoo.com,Town planner,200.220.84.25,fr,77.51
97,"91474 Craig Brooks Suite 633\nNew Patrick, CT ...",42 Nk,AM,Mozilla/5.0 (X11; Linux x86_64; rv:1.9.7.20) G...,"Parker, Nelson and Delgado",3528362130154694,02/25,366,Mastercard,crawfordwilliam@yahoo.com,Travel agency manager,126.124.175.181,ru,17.20
98,"192 Malone Stream Suite 756\nLake Gary, KS 373...",00 zU,AM,Mozilla/5.0 (compatible; MSIE 7.0; Windows NT ...,Simpson Inc,376660848256225,08/23,215,American Express,jeanetteburgess@hotmail.com,"Engineer, water",177.234.46.245,fr,38.75
99,"0156 Williams Ridge\nLake Davidside, SD 58117",78 NS,AM,Mozilla/5.0 (compatible; MSIE 5.0; Windows NT ...,"Harper, Patrick and Richards",4913535442412,07/22,548,American Express,amandastewart@gmail.com,"Lecturer, higher education",136.255.248.130,fr,50.60

In [63]:
print('고객들의 평균 구매 금액 :',ecom['Purchase Price'].mean())
print('최고구매금액과 최소구매금액 :', ecom['Purchase Price'].max(), ecom['Purchase Price'].min())
print('영어권 사용자의 구매금액의 평균 :', ecom[ecom['Language'] == 'en']['Purchase Price'].mean())
print("'Job'이 'Lawyer'인 사람의 숫자 :", len(ecom[ecom['Job'] == 'Lawyer']))
print("'Lot'이 '90 WT'인 곳에서 구매한 사람의 구매금액 :", ecom[ecom['Lot']=='90 WT']['Purchase Price'])
len(ecom[(ecom['CC Provider'] == 'American Express') & (ecom['Purchase Price'] >= 95)])
len(ecom[ecom['CC Exp Date'].apply(lambda x : x[-2:]) =='25'])
sum(ecom['CC Exp Date'].apply(lambda x : x[-2:]) =='25')

고객들의 평균 구매 금액 : 50.347302
최고구매금액과 최소구매금액 : 99.99 0.0
영어권 사용자의 구매금액의 평균 : 51.103014571949
'Job'이 'Lawyer'인 사람의 숫자 : 30
'Lot'이 '90 WT'인 곳에서 구매한 사람의 구매금액 : 513    75.1
Name: Purchase Price, dtype: float64

1033